OpenNuvoton/M2354BSP/SampleCode/StdDriver/SDH_FATFS/main.c
    DIR dir;                /* Directory object */
    UINT u32S1, u32S2, u32Cnt;
    static const uint8_t au8Ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;

    s_pu8Buff = (BYTE *)s_au8BuffPool;

    SYS_Init();
    UART_Open(UART0, 115200);
    timer_init();

    printf("\n");
    printf("====================================\n");
    printf("          SDH Testing               \n");
    printf("====================================\n");

    printf("\n\nSDH FATFS TEST!\n");
    /* Enable NVIC SDH0 IRQ */
    NVIC_EnableIRQ(SDH0_IRQn);
    /*
        SD initial state needs 400KHz clock output, driver will use HIRC for SD initial clock source.
        And then switch back to the user's setting.
    */
    SDH_Open_Disk(SDH0, CardDetect_From_GPIO);
    //SDH_Open_Disk(SDH0, CardDetect_From_DAT3);
    f_chdrive(sd_path);          /* set default path */

    for(;;)
    {
        if(!(SDH_CardDetection(SDH0)))
            continue;

        printf(_T(">"));
        ptr = s_achLine;
        get_line(ptr, sizeof(s_achLine));
        switch(*ptr++)
        {
            case 'q' :  /* Exit program */
                return 0;

            case 'd' :
                switch(*ptr++)
                {
                    case 'd' :  /* dd [<lba>] - Dump sector */
                        if(!xatoi(&ptr, &i32P2)) i32P2 = sect;
                        res = (FRESULT)disk_read(SD_Drv, s_pu8Buff, i32P2, 1);
                        if(res)
                        {
                            printf("rc=%d\n", (WORD)res);
                            break;
                        }
                        sect = i32P2 + 1;
                        printf("Sector:%lu\n", i32P2);
                        for(pu8Buf = (unsigned char*)s_pu8Buff, ofs = 0; ofs < 0x200; pu8Buf += 16, ofs += 16)
                            put_dump(pu8Buf, ofs, 16);
                        break;

                }
                break;

            case 'b' :
                switch(*ptr++)
                {
                    case 'd' :  /* bd <addr> - Dump R/W buffer */
                        if(!xatoi(&ptr, &i32P1)) break;
                        for(ptr = (char*)&s_pu8Buff[i32P1], ofs = i32P1, u32Cnt = 32; u32Cnt; u32Cnt--, ptr += 16, ofs += 16)
                            put_dump((BYTE*)ptr, ofs, 16);
                        break;

                    case 'e' :  /* be <addr> [<data>] ... - Edit R/W buffer */
                        if(!xatoi(&ptr, &i32P1)) break;
                        if(xatoi(&ptr, &i32P2))
                        {
                            do
                            {
                                s_pu8Buff[i32P1++] = (BYTE)i32P2;
                            }
                            while(xatoi(&ptr, &i32P2));
                            break;
                        }
                        for(;;)
                        {
                            printf("%04X %02X-", (WORD)i32P1, s_pu8Buff[i32P1]);
                            get_line(s_achLine, sizeof(s_achLine));
                            ptr = s_achLine;
                            if(*ptr == '.') break;
                            if(*ptr < ' ')
                            {
                                i32P1++;
                                continue;
                            }
                            if(xatoi(&ptr, &i32P2))
                                s_pu8Buff[i32P1++] = (BYTE)i32P2;
                            else
                                printf("???\n");
                        }
                        break;

                    case 'r' :  /* br <sector> [<n>] - Read disk into R/W buffer */
                        if(!xatoi(&ptr, &i32P2)) break;
                        if(!xatoi(&ptr, &i32P3)) i32P3 = 1;
                        printf("rc=%d\n", disk_read(SD_Drv, s_pu8Buff, i32P2, i32P3));
                        break;

                    case 'w' :  /* bw <sector> [<n>] - Write R/W buffer into disk */
                        if(!xatoi(&ptr, &i32P2)) break;
                        if(!xatoi(&ptr, &i32P3)) i32P3 = 1;
                        printf("rc=%d\n", disk_write(SD_Drv, s_pu8Buff, i32P2, i32P3));
                        break;

                    case 'f' :  /* bf <n> - Fill working buffer */
                        if(!xatoi(&ptr, &i32P1)) break;
                        memset(s_pu8Buff, (int)i32P1, BUFF_SIZE);
                        break;

                }
                break;

            case 'f' :
                switch(*ptr++)
                {

                    case 's' :  /* fs - Show logical drive status */
                        res = f_getfree("", (DWORD*)&i32P2, &fs);
                        if(res)
                        {
                            put_rc(res);
                            break;
                        }
                        printf("FAT type = FAT%u\nBytes/Cluster = %lu\nNumber of FATs = %u\n"
                               "Root DIR entries = %u\nSectors/FAT = %lu\nNumber of clusters = %lu\n"
                               "FAT start (lba) = %lu\nDIR start (lba,clustor) = %lu\nData start (lba) = %lu\n\n...",
                               au8Ft[fs->fs_type & 3], fs->csize * 512UL, fs->n_fats,
                               fs->n_rootdir, fs->fsize, fs->n_fatent - 2,
                               fs->fatbase, fs->dirbase, fs->database
                              );
                        s_u32AccSize = s_u16AccFiles = s_u16AccDirs = 0;

                        res = scan_files(ptr);
                        if(res)
                        {
                            put_rc(res);
                            break;
                        }
                        printf("\r%u files, %lu bytes.\n%u folders.\n"
                               "%lu KB total disk space.\n%lu KB available.\n",
                               s_u16AccFiles, s_u32AccSize, s_u16AccDirs,
                               (fs->n_fatent - 2) * (fs->csize / 2), i32P2 * (fs->csize / 2)
                              );
                        break;
                    case 'l' :  /* fl [<path>] - Directory listing */
                        while(*ptr == ' ') ptr++;
                        res = f_opendir(&dir, ptr);
                        if(res)
                        {
                            put_rc(res);
                            break;
                        }
                        i32P1 = u32S1 = u32S2 = 0;
                        for(;;)
                        {
                            res = f_readdir(&dir, &Finfo);
                            if((res != FR_OK) || !Finfo.fname[0]) break;
                            if(Finfo.fattrib & AM_DIR)
                            {
                                u32S2++;
                            }
                            else
                            {
                                u32S1++;
                                i32P1 += Finfo.fsize;
                            }
                            printf("%c%c%c%c%c %d/%02d/%02d %02d:%02d    %9lu  %s",
                                   (Finfo.fattrib & AM_DIR) ? 'D' : '-',
                                   (Finfo.fattrib & AM_RDO) ? 'R' : '-',
                                   (Finfo.fattrib & AM_HID) ? 'H' : '-',
                                   (Finfo.fattrib & AM_SYS) ? 'S' : '-',
                                   (Finfo.fattrib & AM_ARC) ? 'A' : '-',
                                   (Finfo.fdate >> 9) + 1980, (Finfo.fdate >> 5) & 15, Finfo.fdate & 31,
                                   (Finfo.ftime >> 11), (Finfo.ftime >> 5) & 63, Finfo.fsize, Finfo.fname);

                            printf("\n");
                        }
                        printf("%4u File(s),%10lu bytes total\n%4u Dir(s)", u32S1, i32P1, u32S2);
                        if(f_getfree(ptr, (DWORD*)&i32P1, &fs) == FR_OK)
                            printf(", %10lu bytes free\n", i32P1 * fs->csize * 512);
                        break;


                    case 'o' :  /* fo <mode> <file> - Open a file */
                        if(!xatoi(&ptr, &i32P1)) break;
                        while(*ptr == ' ') ptr++;
                        put_rc(f_open(&file1, ptr, (BYTE)i32P1));
                        break;

                    case 'c' :  /* fc - Close a file */
                        put_rc(f_close(&file1));
                        break;

                    case 'e' :  /* fe - Seek file pointer */
                        if(!xatoi(&ptr, &i32P1)) break;
                        res = f_lseek(&file1, i32P1);
                        put_rc(res);
                        if(res == FR_OK)
                            printf("fptr=%lu(0x%lX)\n", file1.fptr, file1.fptr);
                        break;

                    case 'd' :  /* fd <len> - read and dump file from current fp */
                        if(!xatoi(&ptr, &i32P1)) break;
                        ofs = file1.fptr;
                        while(i32P1)
                        {
                            if((UINT)i32P1 >= 16)
                            {
                                u32Cnt = 16;
                                i32P1 -= 16;
                            }
                            else
                            {
                                u32Cnt = i32P1;
                                i32P1 = 0;
                            }
                            res = f_read(&file1, s_pu8Buff, u32Cnt, &u32Cnt);
                            if(res != FR_OK)
                            {
                                put_rc(res);
                                break;
                            }
                            if(!u32Cnt) break;
                            put_dump(s_pu8Buff, ofs, (int32_t)u32Cnt);
                            ofs += 16;
                        }
                        break;

                    case 'r' :  /* fr <len> - read file */
                        if(!xatoi(&ptr, &i32P1)) break;
                        i32P2 = 0;
                        while(i32P1)
                        {
                            if((UINT)i32P1 >= u32Blen)
                            {
                                u32Cnt = u32Blen;
                                i32P1 -= u32Blen;
                            }
                            else
                            {
                                u32Cnt = i32P1;
                                i32P1 = 0;
                            }
                            res = f_read(&file1, s_pu8Buff, u32Cnt, &u32S2);
                            if(res != FR_OK)
                            {
                                put_rc(res);
                                break;
                            }
                            i32P2 += u32S2;
                            if(u32Cnt != u32S2) break;
                        }

                        if(i32P1)
                            printf("%lu bytes read with %lu kB/sec.\n", i32P2, ((i32P2 * 100) / i32P1) / 1024);
                        break;

                    case 'w' :  /* fw <len> <val> - write file */
                        if(!xatoi(&ptr, &i32P1) || !xatoi(&ptr, &i32P2)) break;
                        memset(s_pu8Buff, (BYTE)i32P2, u32Blen);
                        i32P2 = 0;
                        while(i32P1)
                        {
                            if((UINT)i32P1 >= u32Blen)
                            {
                                u32Cnt = u32Blen;
                                i32P1 -= u32Blen;
                            }
                            else
                            {
                                u32Cnt = i32P1;
                                i32P1 = 0;
                            }
                            res = f_write(&file1, s_pu8Buff, u32Cnt, &u32S2);
                            if(res != FR_OK)
                            {
                                put_rc(res);
                                break;
                            }
                            i32P2 += u32S2;
                            if(u32Cnt != u32S2) break;
                        }
                        if(i32P1)
                            printf("%lu bytes written with %lu kB/sec.\n", i32P2, ((i32P2 * 100) / i32P1) / 1024);
                        break;

                    case 'n' :  /* fn <old_name> <new_name> - Change file/dir name */
                        while(*ptr == ' ') ptr++;
                        ptr2 = strchr(ptr, ' ');
                        if(!ptr2) break;
                        *ptr2++ = 0;
                        while(*ptr2 == ' ') ptr2++;
                        put_rc(f_rename(ptr, ptr2));
                        break;

                    case 'u' :  /* fu <name> - Unlink a file or dir */
                        while(*ptr == ' ') ptr++;
                        put_rc(f_unlink(ptr));
                        break;

                    case 'v' :  /* fv - Truncate file */
                        put_rc(f_truncate(&file1));
                        break;

                    case 'k' :  /* fk <name> - Create a directory */
                        while(*ptr == ' ') ptr++;
                        put_rc(f_mkdir(ptr));
                        break;

                    case 'a' :  /* fa <atrr> <mask> <name> - Change file/dir attribute */
                        if(!xatoi(&ptr, &i32P1) || !xatoi(&ptr, &i32P2)) break;
                        while(*ptr == ' ') ptr++;
                        put_rc(f_chmod(ptr, (BYTE)i32P1, (BYTE)i32P2));
                        break;

                    case 't' :  /* ft <year> <month> <day> <hour> <min> <sec> <name> - Change timestamp */
                        if(!xatoi(&ptr, &i32P1) || !xatoi(&ptr, &i32P2) || !xatoi(&ptr, &i32P3)) break;
                        Finfo.fdate = (WORD)(((i32P1 - 1980) << 9) | ((i32P2 & 15) << 5) | (i32P3 & 31));
                        if(!xatoi(&ptr, &i32P1) || !xatoi(&ptr, &i32P2) || !xatoi(&ptr, &i32P3)) break;
                        Finfo.ftime = (WORD)(((i32P1 & 31) << 11) | ((i32P1 & 63) << 5) | ((i32P1 >> 1) & 31));
                        put_rc(f_utime(ptr, &Finfo));
                        break;

                    case 'x' : /* fx <src_name> <dst_name> - Copy file */
                    {
                        uint32_t volatile u32Btime;

                        while(*ptr == ' ') ptr++;
                        ptr2 = strchr(ptr, ' ');
                        if(!ptr2) break;
                        *ptr2++ = 0;
                        while(*ptr2 == ' ') ptr2++;
                        printf("Opening \"%s\"", ptr);
                        res = f_open(&file1, ptr, FA_OPEN_EXISTING | FA_READ);
                        printf("\n");
                        if(res)
                        {
                            put_rc(res);
                            break;
                        }
                        printf("Creating \"%s\"", ptr2);
                        res = f_open(&file2, ptr2, FA_CREATE_ALWAYS | FA_WRITE);
                        putchar('\n');
                        if(res)
                        {
                            put_rc(res);
                            f_close(&file1);
                            break;
                        }
                        printf("Copying...");
                        i32P1 = 0;
                        u32Btime = get_timer_value();
                        for(;;)
                        {
                            res = f_read(&file1, s_pu8Buff, BUFF_SIZE, &u32S1);
                            if(res || u32S1 == 0) break;    /* error or eof */
                            res = f_write(&file2, s_pu8Buff, u32S1, &u32S2);
                            i32P1 += u32S2;
                            if(res || u32S2 < u32S1) break;    /* error or disk full */
                        }
                        printf("\n%lu bytes copied. %d\n", i32P1, (get_timer_value() - u32Btime));
                        f_close(&file1);
                        f_close(&file2);
                    }
                    break;
#if _FS_RPATH
                    case 'g' :  /* fg <path> - Change current directory */
                        while(*ptr == ' ') ptr++;
                        put_rc(f_chdir(ptr));
                        break;

                    case 'j' :  /* fj <drive#> - Change current drive */
                        while(*ptr == ' ') ptr++;
                        dump_buff_hex((uint8_t *)&i32P1, 16);
                        put_rc(f_chdrive((TCHAR *)ptr));
                        break;
#endif
#if _USE_MKFS
                    case 'm' :  /* fm <partition rule> <sect/clust> - Create file system */
                        if(!xatoi(&ptr, &i32P2) || !xatoi(&ptr, &i32P3)) break;
                        printf("The memory card will be formatted. Are you sure? (Y/n)=");
                        get_line(ptr, sizeof(s_achLine));
                        if(*ptr == 'Y')
                            put_rc(f_mkfs(0, (BYTE)i32P2, (WORD)i32P3));
                        break;
#endif
                    case 'z' :  /* fz [<rw size>] - Change R/W length for fr/fw/fx command */
                        if(xatoi(&ptr, &i32P1) && i32P1 >= 1 && (size_t)i32P1 <= BUFF_SIZE)
                            u32Blen = i32P1;
                        printf("blen=%d\n", u32Blen);
                        break;
                }
                break;
            case '?':       /* Show usage */
                printf(
                    _T("n: - Change default drive (SD drive is 0~1)\n")
                    _T("dd [<lba>] - Dump sector\n")
                    //_T("ds <pd#> - Show disk status\n")
                    _T("\n")
                    _T("bd <ofs> - Dump working buffer\n")
                    _T("be <ofs> [<data>] ... - Edit working buffer\n")
                    _T("br <pd#> <sect> [<num>] - Read disk into working buffer\n")
                    _T("bw <pd#> <sect> [<num>] - Write working buffer into disk\n")
                    _T("bf <val> - Fill working buffer\n")
                    _T("\n")
                    _T("fs - Show volume status\n")
                    _T("fl [<path>] - Show a directory\n")
                    _T("fo <mode> <file> - Open a file\n")
                    _T("fc - Close the file\n")
                    _T("fe <ofs> - Move fp in normal seek\n")
                    //_T("fE <ofs> - Move fp in fast seek or Create link table\n")
                    _T("fd <len> - Read and dump the file\n")
                    _T("fr <len> - Read the file\n")
                    _T("fw <len> <val> - Write to the file\n")
                    _T("fn <object name> <new name> - Rename an object\n")
                    _T("fu <object name> - Unlink an object\n")
                    _T("fv - Truncate the file at current fp\n")
                    _T("fk <dir name> - Create a directory\n")
                    _T("fa <atrr> <mask> <object name> - Change object attribute\n")
                    _T("ft <year> <month> <day> <hour> <min> <sec> <object name> - Change timestamp of an object\n")
                    _T("fx <src file> <dst file> - Copy a file\n")
                    _T("fg <path> - Change current directory\n")
                    _T("fj <ld#> - Change current drive. For example: <fj 4:>\n")
                    _T("fm <ld#> <rule> <cluster size> - Create file system\n")
                    _T("\n")
                );
                break;
        }
    }

}

/*** (C) COPYRIGHT 2020 Nuvoton Technology Corp. ***/
